Can't load Linked File [Name] due to errors. Open it separately to investigate the problem.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CannotLoadLink { get; }
  Visual Basic
Public Shared ReadOnly Property CannotLoadLink As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CannotLoadLink {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures DocumentFailures Class
  Autodesk.Revit.DB Namespace